app/Controllers/AchatController.php

    public function index()
    {
        $caisseId = session()->get('caisse_id');
        $clientId = session()->get('client_id');

        if (!$clientId) {
            return redirect()->to('/');
        }

        if (!$caisseId) {
            return redirect()->to('/accueil');
        }

        $caisseModel = new CaisseModel();
        $produitModel = new ProduitModel();
        $achatModel = new AchatModel();

        $caisse = $caisseModel->find($caisseId);
---
SELECT *
FROM `caisse`
WHERE `caisse`.`id` = 1


        return view('achat_form', [
            'caisse' => $caisse,
            'produits' => $produitModel->orderBy('designation', 'ASC')->findAll(),
---
SELECT *
FROM `produit`
ORDER BY `designation` ASC