app/Controllers/AdminController.php

    public function index()
    {
        $produitModel = new ProduitModel();
        $clientModel = new ClientModel();
        $caisseModel = new CaisseModel();
        $achatModel = new AchatModel();

        return view('admin/dashboard', [
            'produitsCount' => $produitModel->countAllResults(),
            'clientsCount' => $clientModel->countAllResults(),
            'caissesCount' => $caisseModel->countAllResults(),
            'achatsCount' => $achatModel->countAllResults(),
            'caisses' => $caisseModel->orderBy('id', 'ASC')->findAll(),
            'success' => session()->getFlashdata('success'),
            'error' => session()->getFlashdata('error'),
        ]);
---
SELECT COUNT(*) AS `numrows`
FROM `produit`
SELECT COUNT(*) AS `numrows`
FROM `client`
SELECT COUNT(*) AS `numrows`
FROM `caisse`
SELECT COUNT(*) AS `numrows`
FROM `achat`
SELECT *
FROM `caisse`
ORDER BY `id` ASC