app/Controllers/Home.php

SELECT *
FROM `caisse`
ORDER BY `id` ASC
---
    public function index()
    {
        if (!session()->get('client_id')) {
            return redirect()->to('/');
        }

        $model = new CaisseModel();

        $data = [
            'caisses' => $model->orderBy('id', 'ASC')->findAll(),
            'error' => session()->getFlashdata('error'),
        ];

SELECT *
FROM `caisse`
WHERE `caisse`.`id` = '1'
---
    public function caisseSelect()
    {
        if (!session()->get('client_id')) {
            return redirect()->to('/');
        }

        $caisseId = $this->request->getPost('caisse_id');

        if (!$caisseId) {
            return redirect()->to('/accueil')->with('error', 'Veuillez choisir une caisse.');
        }

        $model = new CaisseModel();
        $caisse = $model->find($caisseId);