app/Models/AchatModel.php

    public function findByCaisseAndClient(int $caisseId, int $clientId): array
    {
        return $this->select('achat.*, produit.designation, produit.prix, produit.stock, client.nom AS client_nom')
            ->join('produit', 'produit.id = achat.produit_id')
            ->join('client', 'client.id = achat.client_id', 'left')
            ->where('achat.caisse_id', $caisseId)
            ->where('achat.client_id', $clientId)
            ->orderBy('achat.id', 'DESC')
            ->findAll();
---
SELECT `achat`.*, `produit`.`designation`, `produit`.`prix`, `produit`.`stock`, `client`.`nom` AS `client_nom`
FROM `achat`
JOIN `produit` ON `produit`.`id` = `achat`.`produit_id`
LEFT JOIN `client` ON `client`.`id` = `achat`.`client_id`
WHERE `achat`.`caisse_id` = 1
AND `achat`.`client_id` = 5
ORDER BY `achat`.`id` DESC